{
    "category": "Personnel, management and administration procedures",
    "createdBy": "admin",
    "createdOn": 1459465200000,
    "description": "Repository is legally accountable for a breach of copyright, patent infringement or other IPR-related misdemeanour as a direct result ofits business activities. ",
    "id": "R15",
    "identifiedBy": "Drambora version 1",
    "identifiedOn": "1459465200000",
    "mitigationOwner": "Legal",
    "mitigationOwnerType": "Human",
    "mitigationRelatedEventIdentifierType": "",
    "mitigationRelatedEventIdentifierValue": "",
    "mitigationStrategy": "Avoidance strategies:\n- Assess preserved materials to determine those to which intellectual property restrictions may apply\n- Seek legal advice to determine legality of activities with respect to IPR restricted content In the event of risk’s execution:\n- Establish policies and procedures to follow in the event of IPR challenge ",
    "name": "Legal liability for IPR infringement",
    "notes": "\n- Does the repository deal with content with specific associated intellectual property rights?\n- Does the repository consult with legal experts when determining the legality of their activities with respect to IPR restricted content?\n- Is there evidence of a high degree of litigiousness within the domain or jurisdiction within which the repository operates? ",
    "posMitigationImpact": 0,
    "posMitigationProbability": 0,
    "posMitigationSeverity": 12,
    "posMitigationSeverityLevel": "MODERATE",
    "preMitigationImpact": 3,
    "preMitigationNotes": "\n- As part of its preservation activities, the repository reverse engineers a software application, and in doing so contravenes a condition of its end user license agreement\n- An institutional repository disseminates e-journal content, and in doing so is guilty of copyright breach ",
    "preMitigationProbability": 4,
    "preMitigationSeverity": 12,
    "preMitigationSeverityLevel": "MODERATE",
    "updatedBy": "admin",
    "updatedOn": 1459465200000
}
