{
    "category": "Personnel, management and administration procedures",
    "createdBy": "admin",
    "createdOn": 1459465200000,
    "description": "Repository is legally accountable for either failing to fulfil responsibilities or acting beyond the scope of what is permissible, as detailed in legislative instruments. ",
    "id": "R17",
    "identifiedBy": "Drambora version 1",
    "identifiedOn": "1459465200000",
    "mitigationOwner": "Legal",
    "mitigationOwnerType": "Human",
    "mitigationRelatedEventIdentifierType": "",
    "mitigationRelatedEventIdentifierValue": "",
    "mitigationStrategy": "Avoidance strategies:\n- Monitor legislation in order to ensure that policies and procedures correspond to intrinsic requirements and prohibitions\n- Seek legal advice to determine legality of activities with respect to legislation In the event of risk’s execution:\n- Establish policies and procedures to follow in the event of legislative challenge ",
    "name": "Legal liability for breach of legislative requirements",
    "notes": "\n- Is the repository established within legislation?\n- Do any other legislative acts or statutory instruments establish restrictions or obligations related to repository activities?\n- Does the repository consult with legal experts when determining the legality of their activities with respect to relevant legislation?\n- Is there evidence of a high degree of litigiousness within the domain or jurisdiction within which the repository operates? ",
    "posMitigationImpact": 0,
    "posMitigationProbability": 0,
    "posMitigationSeverity": 12,
    "posMitigationSeverityLevel": "MODERATE",
    "preMitigationImpact": 3,
    "preMitigationNotes": "\n- Repository fails to accept deposited materials in contravention of legal deposit laws established in local legislation ",
    "preMitigationProbability": 4,
    "preMitigationSeverity": 12,
    "preMitigationSeverityLevel": "MODERATE",
    "updatedBy": "admin",
    "updatedOn": 1459465200000
}
