
            {

            
            "category": "Personnel, management and administration procedures; Operations and service delivery; Hardware, software or communications equipment and facilities",

                
        "id": "urn:drambora:r77",
    
        "name": "Inability to validate effectiveness of dissemination mechanism",
    
        "description": "Repository is incapable of effectively determining the extent to which its dissemination mechanisms are successful in terms of its overall business objectives. ",
    
        "notes": "\n- Does the repository maintain policies and procedures to verify and record the integrity, authenticity, provenance and understandability of disseminated information?\n- Does the repository maintain policies and procedures to determine usage rights and limit inappropriate access?\n- Are mechanisms to determine the effectiveness of delivery operations exploited on a regular basis? \n\nThe full description of this risk has been obtained from examples provided in DRAMBORA - Digital Repository Audit Method Based on Risk Assessment, March 2007, Digital Curation Centre (DCC) and Digital Preservation Europe (DPE), http://www.repositoryaudit.eu/",
    
        "preMitigationNotes": "\n- Repository end-user feedback questionnaires provide a non-exhaustive set of multi-choice responses that restrict the extent to which responses reflect the success of the dissemination ",
    
        "mitigationOwner": "Dissemination",
    
        "mitigationStrategy": "Avoidance strategies:\n- Establish internal means of assessment including risk management\n- Seek relevant external certification in order to demonstrate effectiveness of dissemination ",
    
        "preMitigationProbability": 4 ,
    
        "preMitigationImpact": 3,
    
        "preMitigationSeverity": 12,
        "preMitigationSeverityLevel": "MODERATE",
    
                "identifiedBy":"DRAMBORA - Digital Repository Audit Method Based on Risk Assessment",
                "mitigationOwnerType": "Human",
                "createdBy": "admin",
                "createdOn": 1459465200000,
                "updatedBy": "admin",
                "updatedOn": 1459465200000,
                "identifiedOn": "1459465200000"
            }
        