
            {

            
            "categories": ["Personnel, management and administration procedures"],

                
        "id": "urn:drambora:r16",
    
        "name": "Legal liability for breach of contractual responsibilities",
    
        "description": "Repository is legally accountable for either failing to fulfil responsibilities or acting beyond the scope of what is permissible, as detailed in stakeholder contracts. ",
    
        "notes": "\n- Does the repository engage in contractual relationships?\n- Does the repository consult with legal experts when determining the legality of their activities with respect to enforceable contracts that they are party to?\n- Is there evidence of a high degree of litigiousness within the domain or jurisdiction within which the repository operates? \n\nThe full description of this risk has been obtained from examples provided in DRAMBORA - Digital Repository Audit Method Based on Risk Assessment, March 2007, Digital Curation Centre (DCC) and Digital Preservation Europe (DPE), http://www.repositoryaudit.eu/",
    
        "preMitigationNotes": "\n- Repository disseminates preserved content over the public Internet without restriction, although the corresponding deposit agreement stated that only a limited community should have access ",
    
        "mitigationOwner": "Legal",
    
        "mitigationStrategy": "Avoidance strategies:\n- Monitor contracts and ensure that implemented policies correspond to their terms\n- Seek legal advice to determine legality of activities with respect to IPR restricted content In the event of risk’s execution:\n- Establish policies and procedures to follow in the event of contractual challenge ",
    
        "preMitigationProbability": 4 ,
    
        "preMitigationImpact": 3,
    
        "preMitigationSeverity": 12,
        "preMitigationSeverityLevel": "MODERATE",
    
                "identifiedBy":"DRAMBORA - Digital Repository Audit Method Based on Risk Assessment",
                "mitigationOwnerType": "Human",
                "createdBy": "admin",
                "createdOn": 1459465200000,
                "updatedBy": "admin",
                "updatedOn": 1459465200000,
                "identifiedOn": "1459465200000"
            }
        