
            {

            
            "category": "Operations and service delivery",

                
        "id": "urn:drambora:r64",
    
        "name": "Identifier to information referential integrity is compromised",
    
        "description": "Where identifiers are applied to information, the repository is incapableof locating the archival package that corresponds to a given ID. ",
    
        "notes": "\n- Does repository apply or maintain existing persistent identifiers for information packages?\n- Is identifier potentially distinguishable from related information? \n\nThe full description of this risk has been obtained from examples provided in DRAMBORA - Digital Repository Audit Method Based on Risk Assessment, March 2007, Digital Curation Centre (DCC) and Digital Preservation Europe (DPE), http://www.repositoryaudit.eu/",
    
        "preMitigationNotes": "\n- Repository maintains the use of the file path from the digital object’s original environment as the identifier for the archived object, resulting in two distinct objects that originated from different locations sharing the duplicate identifer “/Documents and Settings/John Smith/Document.pdf”\n- Identifiers generated at ingest consist of the timestamp at the point of ingest, but two ingest systems operate simultaneously and duplicate identifiers are consequently applied ",
    
        "mitigationOwner": "Preservation",
    
        "mitigationStrategy": "Avoidance strategies:\n- Define, document and review policies and procedures describing the means by which identifiers are associated with corresponding information packages and communicate this information widely within the organisation\n- Define and review policies and procedures describing the creation of identifiers to ensure their uniqueness, or mandating the adoption of third-party identifier technologies such as Handles, DOIs or PURLs In the event of risk’s execution:\n- Define policy to respond to fracturing of relationship between identifiers and information\n- Invoke treatment strategies to alleviate loss of reputation ",
    
        "preMitigationProbability": 4 ,
    
        "preMitigationImpact": 3,
    
        "preMitigationSeverity": 12,
        "preMitigationSeverityLevel": "MODERATE",
    
                "identifiedBy":"DRAMBORA - Digital Repository Audit Method Based on Risk Assessment",
                "mitigationOwnerType": "Human",
                "createdBy": "admin",
                "createdOn": 1459465200000,
                "updatedBy": "admin",
                "updatedOn": 1459465200000,
                "identifiedOn": "1459465200000"
            }
        