
            {

            
            "category": "Hardware, software or communications equipment and facilities",

                
        "id": "urn:drambora:r34",
    
        "name": "Media degradation or obsolescence",
    
        "description": "Storage media deteriorates, limiting the extent to which it can be written to and read from.  ",
    
        "notes": "\n- Does the repository preserve digital content on removable media such as tapes, optical disks and flash devices?\n- Are employed storage media formats used widely within contemporary and comparable organisations?\n- Is the mean lifetime of relied upon media technologies understood and documented? \n\nThe full description of this risk has been obtained from examples provided in DRAMBORA - Digital Repository Audit Method Based on Risk Assessment, March 2007, Digital Curation Centre (DCC) and Digital Preservation Europe (DPE), http://www.repositoryaudit.eu/",
    
        "preMitigationNotes": "\n- Tape-stored content is inaccessible or corrupted due to physical deterioration of magnetic tape\n- Contemporary tape drives are incapable of reading dated storage media which is prolific throughout archive ",
    
        "mitigationOwner": "Technical",
    
        "mitigationStrategy": "Avoidance strategies:\n- Allocate a proportion of staff time to monitoring the expected lifetime of storage media and assessing the potential value of emerging technologies\n- Pre-empt media obsolescence with anticipatory investment In the event of risk’s execution:\n- Maintain redundant copies of information objects\n- Establish policies and procedures to extract archived materials from degraded media ",
    
        "preMitigationProbability": 4 ,
    
        "preMitigationImpact": 3,
    
        "preMitigationSeverity": 12,
        "preMitigationSeverityLevel": "MODERATE",
    
                "identifiedBy":"DRAMBORA - Digital Repository Audit Method Based on Risk Assessment",
                "mitigationOwnerType": "Human",
                "createdBy": "admin",
                "createdOn": 1459465200000,
                "updatedBy": "admin",
                "updatedOn": 1459465200000,
                "identifiedOn": "1459465200000"
            }
        