
            {

            
            "categories": ["Operations and service delivery","Hardware, software or communications equipment and facilities"],

                
        "id": "urn:drambora:r09",
    
        "name": "Community feedback not received",
    
        "description": "Repository fails to solicit responses from the community regarding its level of service, or fails to provide mechanisms for this. ",
    
        "notes": "\n- Does repository have mechanisms available to solicit feedback from community members?\n- Is a proportion of staff time allocated to the gathering or receipt of community feedback?\n- Are feedback mechanisms regularly tested to ensure they are functioning correctly? \n\nThe full description of this risk has been obtained from examples provided in DRAMBORA - Digital Repository Audit Method Based on Risk Assessment, March 2007, Digital Curation Centre (DCC) and Digital Preservation Europe (DPE), http://www.repositoryaudit.eu/",
    
        "preMitigationNotes": "\n- Repository fails to identify that its user communities are increasingly incapable of using data encoded within the repository’s chosen formats with the software that they principally employ ",
    
        "mitigationOwner": "Management",
    
        "mitigationStrategy": "Avoidance strategies:\n- Maintain appropriate mechanisms for community to provide feedback, such as email, web-forms, telephone helpdesk and mail address\n- Actively solicit feedback, allocating a proportion of staff time to community engagement In the event of risk’s execution:\n- Identify reasons for communication failure and update policies and procedures accordingly ",
    
        "preMitigationProbability": 4 ,
    
        "preMitigationImpact": 3,
    
        "preMitigationSeverity": 12,
        "preMitigationSeverityLevel": "MODERATE",
    
                "identifiedBy":"DRAMBORA - Digital Repository Audit Method Based on Risk Assessment",
                "mitigationOwnerType": "Human",
                "createdBy": "admin",
                "createdOn": 1459465200000,
                "updatedBy": "admin",
                "updatedOn": 1459465200000,
                "identifiedOn": "1459465200000"
            }
        