
            {

            
            "categories": ["Operations and service delivery"],

                
        "id": "urn:drambora:r06",
    
        "name": "Community requirements change substantially",
    
        "description": "Community expectations or requirements are substantially altered, and no longer correspond to business activities. ",
    
        "notes": "\n- Have user requirements been subject to change in the past?\n- Has the repository or have other external, comparable repositories experienced a change or evolution in the communities using or depositing content? \n\nThe full description of this risk has been obtained from examples provided in DRAMBORA - Digital Repository Audit Method Based on Risk Assessment, March 2007, Digital Curation Centre (DCC) and Digital Preservation Europe (DPE), http://www.repositoryaudit.eu/",
    
        "preMitigationNotes": "\n- User community adopts new software systems which provide no support for legacy data formats that were previously dominant\n- Community becomes increasingly unfamiliar with the semantics of a previously well-known and widely employed scientific markup language ",
    
        "mitigationOwner": "Management",
    
        "mitigationStrategy": "Avoidance strategies:\n- Monitor requirements, expectations and knowledge base of user community\n- Document and review organisational definition of understandability for each distinct user community In the event of risk’s execution:\n- Maintain flexible approach to operational objectives to react to emerging community requirements ",
    
        "preMitigationProbability": 4 ,
    
        "preMitigationImpact": 3,
    
        "preMitigationSeverity": 12,
        "preMitigationSeverityLevel": "MODERATE",
    
                "identifiedBy":"DRAMBORA - Digital Repository Audit Method Based on Risk Assessment",
                "mitigationOwnerType": "Human",
                "createdBy": "admin",
                "createdOn": 1459465200000,
                "updatedBy": "admin",
                "updatedOn": 1459465200000,
                "identifiedOn": "1459465200000"
            }
        