
            {

            
            "category": "Physical environment; Personnel, management and administration procedures; Operations and service delivery; Hardware, software or communications equipment andfacilities",

                
        "id": "urn:drambora:r41",
    
        "name": "Deliberate system sabotage",
    
        "description": "Business activities are adversely affected by measures intended to havethese effects. ",
    
        "notes": "\n- Is it conceivable that individuals may seek to maliciously damage repository content or systems?\n- To what extent are system interactions, or those undertaken by circumventing the system, reversible?\n- Are members of staff that leave the organisation accompanied off-site and stripped of system access and authorisations? \n\nThe full description of this risk has been obtained from examples provided in DRAMBORA - Digital Repository Audit Method Based on Risk Assessment, March 2007, Digital Curation Centre (DCC) and Digital Preservation Europe (DPE), http://www.repositoryaudit.eu/",
    
        "preMitigationNotes": "\n- e-Terrorism or physical (conventional) terrorism\n- Disaffected staff members maliciously vandalise systems ",
    
        "mitigationOwner": "Technical",
    
        "mitigationStrategy": "Avoidance strategies:\n- Maintain, test and revise physical and software security in accordance with relevant standards\n- Monitor for suspicious network activity or physical activity that appears unusual\n- Remove staff members or ex-staff members that are likely to be disaffected and immediately revoke system privileges In the event of risk’s execution:\n- Ensure as far as possible that all system interactions are reversible\n- Ensure availability of redundant copies of system state and archived information at remote geographical location ",
    
        "preMitigationProbability": 4 ,
    
        "preMitigationImpact": 3,
    
        "preMitigationSeverity": 12,
        "preMitigationSeverityLevel": "MODERATE",
    
                "identifiedBy":"DRAMBORA - Digital Repository Audit Method Based on Risk Assessment",
                "mitigationOwnerType": "Human",
                "createdBy": "admin",
                "createdOn": 1459465200000,
                "updatedBy": "admin",
                "updatedOn": 1459465200000,
                "identifiedOn": "1459465200000"
            }
        