
            {

            
            "category": "Operations and service delivery",

                
        "id": "urn:drambora:r18",
    
        "name": "Liability for regulatory non-compliance",
    
        "description": "Repository is liable for failure to conduct its activities in accordance with industrial, business oriented or global regulation. ",
    
        "notes": "\n- Do any regulations establish restrictions or obligations related to repository activities?\n- Does the repository consult with legal experts when determining the legality of their activities with respect to relevant regulations?\n- Is there evidence of a high degree of litigiousness within the domain or jurisdiction within which the repository operates? \n\nThe full description of this risk has been obtained from examples provided in DRAMBORA - Digital Repository Audit Method Based on Risk Assessment, March 2007, Digital Curation Centre (DCC) and Digital Preservation Europe (DPE), http://www.repositoryaudit.eu/",
    
        "preMitigationNotes": "\n- Repository fails to conform to appropriate jurisdictional health and safety regulations for employees ",
    
        "mitigationOwner": "Legal",
    
        "mitigationStrategy": "Avoidance strategies:\n- Monitor regulatory framework and ensure policies and procedures correspond to their requirements and prohibitions\n- Seek legal advice to determine legality of activities with respect to regulatory framework In the event of risk’s execution:\n- Establish policies and procedures to follow in the event of IPR challenge ",
    
        "preMitigationProbability": 4 ,
    
        "preMitigationImpact": 3,
    
        "preMitigationSeverity": 12,
        "preMitigationSeverityLevel": "MODERATE",
    
                "identifiedBy":"DRAMBORA - Digital Repository Audit Method Based on Risk Assessment",
                "mitigationOwnerType": "Human",
                "createdBy": "admin",
                "createdOn": 1459465200000,
                "updatedBy": "admin",
                "updatedOn": 1459465200000,
                "identifiedOn": "1459465200000"
            }
        