
            {

            
            "categories": ["Operations and service delivery"],

                
        "id": "urn:drambora:r11",
    
        "name": "Business fails to preserve essential characteristics of digital information",
    
        "description": "Repository’s preservation activities are insufficient to maintain the properties of its digital holdings that are of greatest significance to itsuser communities ",
    
        "notes": "\n- Are significant properties defined and documented for each class of object preserved within the repository?\n- Are members of the community consulted throughout the process of defining significant properties?\n- Are preservation policies and procedures sufficient to maintain defined properties? \n\nThe full description of this risk has been obtained from examples provided in DRAMBORA - Digital Repository Audit Method Based on Risk Assessment, March 2007, Digital Curation Centre (DCC) and Digital Preservation Europe (DPE), http://www.repositoryaudit.eu/",
    
        "preMitigationNotes": "\n- Repository preserves transcribed text from digitised manuscripts within .txt files, although user communities are interested in looking at the original illuminations in subsequent research\n- Repository aims to preserve images of manuscript illuminations but chosen resolution is insufficient to display the level of detail required by user community ",
    
        "mitigationOwner": "Management",
    
        "mitigationStrategy": "Avoidance strategies: \n- Document significant properties of digital objects that will be maintained, based on community expectations and requirements In the event of risk’s execution:\n- Acknowledge organisational shortcoming and revise policies and significant properties definition accordingly ",
    
        "preMitigationProbability": 4 ,
    
        "preMitigationImpact": 3,
    
        "preMitigationSeverity": 12,
        "preMitigationSeverityLevel": "MODERATE",
    
                "identifiedBy":"DRAMBORA - Digital Repository Audit Method Based on Risk Assessment",
                "mitigationOwnerType": "Human",
                "createdBy": "admin",
                "createdOn": 1459465200000,
                "updatedBy": "admin",
                "updatedOn": 1459465200000,
                "identifiedOn": "1459465200000"
            }
        