
            {

            
            "categories": ["Physical environment","Personnel, management and administration procedures","Operations and service delivery","Hardware, software or communications equipment and facilities"],

                
        "id": "urn:drambora:r03",
    
        "name": "Activity is overlooked or allocated insufficient resources",
    
        "description": "An integral business activity is mismanaged leading to its noncompletion. ",
    
        "notes": "\n- Is repository responsible for budgetary development and allocation of resources? \n\nThe full description of this risk has been obtained from examples provided in DRAMBORA - Digital Repository Audit Method Based on Risk Assessment, March 2007, Digital Curation Centre (DCC) and Digital Preservation Europe (DPE), http://www.repositoryaudit.eu/",
    
        "preMitigationNotes": "\n- Repository budgeting does not include a financial allocation for system security maintenance\n- A 0.5 FTE has sole responsibility to ingest 100 objects per day, although it takes on average 30 minutes for an individual to ingest a single object ",
    
        "mitigationOwner": "Management",
    
        "mitigationStrategy": "Avoidance strategies:\n- Derive activities, policies and procedures from fundamental repository objectives\n- Allocate resources to correspond with identified activities\n- Establish mechanisms to review and adjust resource allocations In the event of risk’s execution:\n- Maintain residual fund to facilitate subsequent resourcing of originally overlooked activity ",
    
        "preMitigationProbability": 4 ,
    
        "preMitigationImpact": 3,
    
        "preMitigationSeverity": 12,
        "preMitigationSeverityLevel": "MODERATE",
    
                "identifiedBy":"DRAMBORA - Digital Repository Audit Method Based on Risk Assessment",
                "mitigationOwnerType": "Human",
                "createdBy": "admin",
                "createdOn": 1459465200000,
                "updatedBy": "admin",
                "updatedOn": 1459465200000,
                "identifiedOn": "1459465200000"
            }
        