
            {

            
            "categories": ["Operations and service delivery"],

                
        "id": "urn:drambora:r65",
    
        "name": "Preservation plans cannot be implemented",
    
        "description": "Repository is incapable of executing in practice the preservation planning it has undertaken. ",
    
        "notes": "\n- Is preservation planning undertaken within the repository with the anticipation that it will subsequently be implemented?\n- Does preservation planning reflect the extent of technological, financial and human resources available within the repository as well as its organisational objectives? \n\nThe full description of this risk has been obtained from examples provided in DRAMBORA - Digital Repository Audit Method Based on Risk Assessment, March 2007, Digital Curation Centre (DCC) and Digital Preservation Europe (DPE), http://www.repositoryaudit.eu/",
    
        "preMitigationNotes": "\n- Repository’s planned emulation strategy requires technological expertise to implement that is unavailable within the staff, and insufficient resource exists to contract with third-party developers to undertake the work ",
    
        "mitigationOwner": "Preservation",
    
        "mitigationStrategy": "Avoidance strategies:\n- Aim to reflect the extent of technological, financial and human resources available within the repository as well as its organisational objectives when conceiving preservation plans\n- Seek additional resources to facilitate original plans In the event of risk’s execution:\n- Implement policy to refine preservation plans to correspond more closely to that which is feasible within the organisation ",
    
        "preMitigationProbability": 4 ,
    
        "preMitigationImpact": 3,
    
        "preMitigationSeverity": 12,
        "preMitigationSeverityLevel": "MODERATE",
    
                "identifiedBy":"DRAMBORA - Digital Repository Audit Method Based on Risk Assessment",
                "mitigationOwnerType": "Human",
                "createdBy": "admin",
                "createdOn": 1459465200000,
                "updatedBy": "admin",
                "updatedOn": 1459465200000,
                "identifiedOn": "1459465200000"
            }
        