
            {

            
            "categories": ["Personnel, management and administration procedures"],

                
        "id": "urn:drambora:r28",
    
        "name": "Financial shortfalls or income restrictions",
    
        "description": "Atypical operational circumstances result in budgetary shortfall or gap. ",
    
        "notes": "\n- To what extent is the repository's annual budgetary allocation assured?\n- Is the repository required to make any capital investments on a less than annual basis?\n- Is there a possibility of expenditure commitments arising without warning and with a requirement for immediate investment? \n\nThe full description of this risk has been obtained from examples provided in DRAMBORA - Digital Repository Audit Method Based on Risk Assessment, March 2007, Digital Curation Centre (DCC) and Digital Preservation Europe (DPE), http://www.repositoryaudit.eu/",
    
        "preMitigationNotes": "\n- Unanticipated enforced expenditure, such as replacement of non-functioning technological assets\n- Expenditure on new server systems every four years, rendering investment during those budgeting periods far in excess of the other three-quarters of the time ",
    
        "mitigationOwner": "Budgeting",
    
        "mitigationStrategy": "Avoidance strategies:\n- Manage budgetary allocations, bearing in mind commitments that are less than annual\n- Calculate replacement timescale for repository resources and aim to pre-empt hardware failure by reinvesting regularly In the event of risk’s execution:\n- Maintain residual emergency fund ",
    
        "preMitigationProbability": 4 ,
    
        "preMitigationImpact": 3,
    
        "preMitigationSeverity": 12,
        "preMitigationSeverityLevel": "MODERATE",
    
                "identifiedBy":"DRAMBORA - Digital Repository Audit Method Based on Risk Assessment",
                "mitigationOwnerType": "Human",
                "createdBy": "admin",
                "createdOn": 1459465200000,
                "updatedBy": "admin",
                "updatedOn": 1459465200000,
                "identifiedOn": "1459465200000"
            }
        