
            {

            
            "categories": ["Operations and service delivery","Hardware, software or communications equipment and facilities"],

                
        "id": "urn:drambora:r74",
    
        "name": "Non-availability of information delivery services",
    
        "description": "Repository is unable to provide access to information packages. ",
    
        "notes": "\n- What systems are required to provide dissemination services?\n- Does the repository offer a variety of alternative delivery services?\n- Do policies and procedures exist to describe the means by which information is disseminated? \n\nThe full description of this risk has been obtained from examples provided in DRAMBORA - Digital Repository Audit Method Based on Risk Assessment, March 2007, Digital Curation Centre (DCC) and Digital Preservation Europe (DPE), http://www.repositoryaudit.eu/",
    
        "preMitigationNotes": "\n- Web server relied upon for dissemination of materials is off-line due to network services failure ",
    
        "mitigationOwner": "Dissemination",
    
        "mitigationStrategy": "Avoidance strategies:\n- Define policies describing available information delivery services and communicate these to the user community\n- Implement appropriate systems to meet delivery policy requirements\n- Establish sufficiently robust technical infrastructure to satisfy demands of proposed delivery services ",
    
        "preMitigationProbability": 4 ,
    
        "preMitigationImpact": 3,
    
        "preMitigationSeverity": 12,
        "preMitigationSeverityLevel": "MODERATE",
    
                "identifiedBy":"DRAMBORA - Digital Repository Audit Method Based on Risk Assessment",
                "mitigationOwnerType": "Human",
                "createdBy": "admin",
                "createdOn": 1459465200000,
                "updatedBy": "admin",
                "updatedOn": 1459465200000,
                "identifiedOn": "1459465200000"
            }
        