
            {

            
            "categories": ["Operations and service delivery"],

                
        "id": "urn:drambora:r07",
    
        "name": "Community requirements misunderstood or miscommunicated",
    
        "description": "Repository is incapable of determining the expectations of its stakeholder communities and therefore unable to tailor business activities appropriately. ",
    
        "notes": "\n- Does the repository have mechanisms established to monitor the community's knowledge base, requirements or expectations?\n- Are community members consulted about the adequacy of available service levels? \n\nThe full description of this risk has been obtained from examples provided in DRAMBORA - Digital Repository Audit Method Based on Risk Assessment, March 2007, Digital Curation Centre (DCC) and Digital Preservation Europe (DPE), http://www.repositoryaudit.eu/",
    
        "preMitigationNotes": "\n- Repository fails to identify that its user communities require data to be delivered encoded as .abc files in order for them to be usable ",
    
        "mitigationOwner": "Management",
    
        "mitigationStrategy": "Avoidance strategies:\n- Establish appropriate technical mechanisms to facilitate monitoring of requirements, expectations and knowledge base of user community In the event of risk’s execution:\n- Maintain dialogue with community to ensure the continued correctness of understandability definition\n- Maintain flexibility within operational objectives to react to misunderstanding of requirements ",
    
        "preMitigationProbability": 4 ,
    
        "preMitigationImpact": 3,
    
        "preMitigationSeverity": 12,
        "preMitigationSeverityLevel": "MODERATE",
    
                "identifiedBy":"DRAMBORA - Digital Repository Audit Method Based on Risk Assessment",
                "mitigationOwnerType": "Human",
                "createdBy": "admin",
                "createdOn": 1459465200000,
                "updatedBy": "admin",
                "updatedOn": 1459465200000,
                "identifiedOn": "1459465200000"
            }
        