
            {

            
            "categories": ["Hardware, software or communications equipment and facilities"],

                
        "id": "urn:drambora:r33",
    
        "name": "Obsolescence of hardware or software",
    
        "description": "Core technology is no longer current or is incongruent with that of most comparable organisations. ",
    
        "notes": "\n- Do vendors of currently employed hardware and software technologies offer a guaranteed period of support?\n- Are hardware and software technologies employed widely within contemporary and comparable organisations?\n- What is the mean-time-between-failure associated with the repository's chosen technologies? \n\nThe full description of this risk has been obtained from examples provided in DRAMBORA - Digital Repository Audit Method Based on Risk Assessment, March 2007, Digital Curation Centre (DCC) and Digital Preservation Europe (DPE), http://www.repositoryaudit.eu/",
    
        "preMitigationNotes": "\n- Operating systems no longer supported by vendor, and therefore security updates are no longer being made available. ",
    
        "mitigationOwner": "Technical",
    
        "mitigationStrategy": "Avoidance strategies:\n- Allocate a proportion of staff time to monitoring the ongoing suitability of repository technologies and assessing the potential value of emerging technologies\n- Pre-empt technological obsolescence with anticipatory investment ",
    
        "preMitigationProbability": 4 ,
    
        "preMitigationImpact": 3,
    
        "preMitigationSeverity": 12,
        "preMitigationSeverityLevel": "MODERATE",
    
                "identifiedBy":"DRAMBORA - Digital Repository Audit Method Based on Risk Assessment",
                "mitigationOwnerType": "Human",
                "createdBy": "admin",
                "createdOn": 1459465200000,
                "updatedBy": "admin",
                "updatedOn": 1459465200000,
                "identifiedOn": "1459465200000"
            }
        