
            {

            
            "categories": ["Operations and service delivery","Hardware, software or communications equipment and facilities"],

                
        "id": "urn:drambora:r75",
    
        "name": "Authentication subsystem fails",
    
        "description": "Systems for limiting accessibility of information are insufficient, resulting in inappropriate accesses or failures to access. ",
    
        "notes": "\n- Is repository compelled by contracts or mandate to establish and maintain a means of limiting end-user access to archived information?\n- What systems are necessary to maintain the operation of the repository's authentication controls? \n\nThe full description of this risk has been obtained from examples provided in DRAMBORA - Digital Repository Audit Method Based on Risk Assessment, March 2007, Digital Curation Centre (DCC) and Digital Preservation Europe (DPE), http://www.repositoryaudit.eu/",
    
        "preMitigationNotes": "\n- Individuals who are not entitled to have access to the content can access it. Repository system relies upon IP-based authentication, but since all users within University x access the web via a web proxy the application perceives any access from that campus as coming from a single IP, and every resident user gains access. ",
    
        "mitigationOwner": "Dissemination",
    
        "mitigationStrategy": "Avoidance strategies:\n- Define policies describing authentication requirements to correspond with conditions expressed in deposit agreements and other regulatory, legislative or contextual provisions\n- Implement appropriate systems to meet authentication policy requirements\n- Establish sufficiently robust technical infrastructure to satisfy demands of proposed authentication services In the event of risk’s execution:\n- Determine the shortcoming that led to authentication failure and subsequently remedy it\n- If system is self-aware of its failure, implement a policy to describe the appropriate reaction; for instance, upon failure refuse all access attempts ",
    
        "preMitigationProbability": 4 ,
    
        "preMitigationImpact": 3,
    
        "preMitigationSeverity": 12,
        "preMitigationSeverityLevel": "MODERATE",
    
                "identifiedBy":"DRAMBORA - Digital Repository Audit Method Based on Risk Assessment",
                "mitigationOwnerType": "Human",
                "createdBy": "admin",
                "createdOn": 1459465200000,
                "updatedBy": "admin",
                "updatedOn": 1459465200000,
                "identifiedOn": "1459465200000"
            }
        