{
	"id": "urn:FormatMissingRepresentationInformation:r1",
	"name": "Comprehensive representation information is missing for some files in the repository",
	"description": "Representation information is any information required to understand and render both the digital material and the associated metadata. Digital objects are stored as bitstreams, which are not understandable to a human being without further data to interpret them. Representation information is the extra structural or semantic information, which converts raw data into something more meaningful.\nFor example, structure information could tell a computer to interpret a string of bits as ASCII characters and semantic information could explain what a particular mathematical symbol means.\nRepresentation information should contain as much structure and semantic information as is required for a defined community (or Designated Community in OAIS terminology) to access the information stored within a digital object.\nThe term can be applied to all levels of abstraction and refers to both the structural and semantic composition. It can therefore be recursive and is dependent on the knowledge base of the designated community.\nRepresentation information is not the same thing as metadata which describes data in administrative, descriptive, technical, structural and preservation terms.\nIn this repository, Representation information is managed in the \"Format registry\" panel. For each file found in the repository, a comprehensive format description is expected to be found in this registry.",
	"identifiedOn": 1468515641122,
	"identifiedBy": "Risk automatically detected by the Format Missing Representation Information assessor plugin \"org.roda.core.plugins.riskManagement.FormatMissingRepresentationInformation\".",
	"category": "Content characterization",
	"notes": "The description of this risk has been partially obtained from the article \"What is representation information?\" published by the Digital Curation Centre (DCC) found at http://www.dcc.ac.uk/node/9558",
	"preMitigationProbability": 4,
	"preMitigationImpact": 3,
	"preMitigationSeverity": 12,
	"preMitigationSeverityLevel": "MODERATE",
	"preMitigationNotes": "If no action is taken there is a high risk that certain files will not readable in the future due to lack of suficient knowledge about the format/structure in which the information is encoded, the tools/libraries that support them and the environment necessary to properly render them. This affects the ability of the repository to provide future access information under its control.",
	"mitigationStrategy": "Add comprehensive Representation information to the format registry for all the formats currently missing.",
	"createdOn": 1468515641122,
	"createdBy": "admin"
}
