{
    "category": "Operations and service delivery",
    "createdBy": "admin",
    "createdOn": 1459465200000,
    "description": "Repository is incapable of demonstrating the reliability of its information holdings. ",
    "id": "R58",
    "identifiedBy": "Drambora version 1",
    "identifiedOn": "1459465200000",
    "mitigationOwner": "Preservation",
    "mitigationOwnerType": "Human",
    "mitigationRelatedEventIdentifierType": "",
    "mitigationRelatedEventIdentifierValue": "",
    "mitigationStrategy": "Avoidance strategies:\n- Ensure policies and procedures are conceived with due consideration of reliability requirements\n- Maintain and review policies and procedures to ensure adequate recording and comparison of checksums to demonstrate that archived information has suffered no loss of integrity since its deposit or receipt\n- Maintain and review policies and procedures to ensure adequate recording of provenance information to demonstrate that archived material represents authentic representation of what was initially deposited or received\n- Ensure software and hardware systems and preservation strategies are capable of preserving information reliability In the event of risk’s execution:\n- Invoke treatment strategies to alleviate loss of reputation or trust ",
    "name": "Loss of information reliability",
    "notes": "\n- Does repository commit to preserve reliability of information? ",
    "posMitigationImpact": 0,
    "posMitigationProbability": 0,
    "posMitigationSeverity": 12,
    "posMitigationSeverityLevel": "MODERATE",
    "preMitigationImpact": 3,
    "preMitigationNotes": "\n- Archived information within a meteorological data centre is regarded as being insufficiently reliable to form the basis for scientific research\n- A court of law refuses to admit archived information as evidence on the grounds that it is unreliable ",
    "preMitigationProbability": 4,
    "preMitigationSeverity": 12,
    "preMitigationSeverityLevel": "MODERATE",
    "updatedBy": "admin",
    "updatedOn": 1459465200000
}
